source/_static/diagrams/32-beside-not-inside.d2
direction: right
n0: "EESSI tree"
n1: "host injection"
n2: "site MPI"
n3: "compatible join"
n2 -> n1
n0 -> n3
